app/views/room/show.html.erb

SELECT "messages".* FROM "messages" WHERE "messages"."room_id" = $1  [["room_id", 1]]
---
			<% if @room.messages %>
				<% @room.messages.each do |message| %>