app/controllers/room_controller.rb

	def create
		@room = Room.create(name: params[:chatroom][:name], created_by: session[:current_user])
---
INSERT INTO "rooms" ("created_at", "created_by", "members", "messages", "name", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Mon, 14 Apr 2014 22:02:00 UTC +00:00], ["created_by", 1], ["members", "--- []\n"], ["messages", "--- {}\n"], ["name", "roome"], ["updated_at", Mon, 14 Apr 2014 22:02:00 UTC +00:00]]

	def leave
		@room = Room.find(params[:format])
		@room.leave(User.find(session[:current_user]))
---
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT 1  [["id", "1"]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

	def add_message
		username = User.find(session[:current_user]).username
		@room = Room.find(params[:sending][:room_id])
		message = Message.new(message: params[:sending][:message], username: username)
		@room.messages << message
		@room.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "messages" ("created_at", "message", "room_id", "updated_at", "username") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Mon, 14 Apr 2014 22:03:47 UTC +00:00], ["message", "yoyo"], ["room_id", 1], ["updated_at", Mon, 14 Apr 2014 22:03:47 UTC +00:00], ["username", "me"]]
UPDATE "rooms" SET "updated_at" = ?, "members" = ?, "messages" = ? WHERE "rooms"."id" = 1  [["updated_at", Sun, 13 Apr 2014 21:53:52 UTC +00:00], ["members", "--- []\n"], ["messages", "---\n:username: \"yoyoyo\\r\\n\"\n"]]