app/controllers/room_controller.rb

	def show
		@room = Room.find(params[:id])
		@room.join(User.find(session[:current_user]))
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]