app/controllers/user_controller.rb

	def show
		@user = User.find(params[:id])
		@rooms = Room.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
SELECT "rooms".* FROM "rooms"

	def create
		@user = User.new(user_params)
		if @user.save
---
INSERT INTO "users" ("created_at", "password_digest", "updated_at", "username") VALUES ($1, $2, $3, $4) RETURNING "id"

	def login
		if @user = User.find_by_username(params[:user][:username])
---
SELECT "users".* FROM "users" WHERE "users"."username" = 'bill' LIMIT 1